Rails/odin-flight-booker/app/controllers/flights_controller.rb

  def index
    @search = Flight.search(params)
    @airports = Airport.all.map { |x| x.codename }
---
SELECT "flights".* FROM "flights" WHERE (from_airport_id = NULL AND to_airport_id = NULL AND departure_date >= NULL)
SELECT "airports".* FROM "airports"