Rails/private-events/app/controllers/events_controller.rb

  def index
  	@events = Event.all
---
SELECT "events".* FROM "events" WHERE (day >= '-4712-01-06' )

  def create
  	@event = current_user.events.build(event_params)
  	if @event.save
---
INSERT INTO "events" ("created_at", "creator_id", "description", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 17 Apr 2014 01:06:14 UTC +00:00], ["creator_id", 1], ["description", "Hello"], ["updated_at", Thu, 17 Apr 2014 01:06:14 UTC +00:00]]