Rails/private-events/app/views/users/show.html.erb

SELECT 1 AS one FROM "events" WHERE "events"."user_id" = ? LIMIT 1  [[nil, 2]]
---
<br>
<% if @user.events.any? %>