Rails/members-only/app/controllers/posts_controller.rb

	def create
		#automatically creates a post with the author's foreign key
		@post = current_user.posts.build(note: current_user[:id])
		redirect_to posts_path if @post.save #post/index.html.erb
---
INSERT INTO "posts" ("created_at", "note", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 11 Apr 2014 20:50:00 UTC +00:00], ["note", 1], ["updated_at", Fri, 11 Apr 2014 20:50:00 UTC +00:00], ["user_id", 1]]