Rails/members-only/app/views/posts/_post.html.erb

SELECT "posts".* FROM "posts"
---
<!-- This partial automatically iterates through Post.all -->

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  <% if signed_in? %>
  	<span class="post_author">by <%= User.find(post.user_id).name %>.</span>